{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Extra resource: Knowledge Graphs for RAG (`www.deeplearning.ai`)**\n",
    "\n",
    "**Start the Movie Neo4j DB**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = \"bolt://localhost:7687\"\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"12345678\"\n",
    "NEO4J_DATABASE = 'neo4j'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 132}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 132}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 20}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Movie nodes by specifying the node label\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie) \n",
    "  RETURN count(m) AS numberOfMovies\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPeople': 101}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Person nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (people:Person) \n",
    "  RETURN count(people) AS numberOfPeople\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom': {'name': 'Tom Hanks'}}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single person by specifying the value of the `name` property on the `Person` node\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "  RETURN tom\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single Movie by specifying the value of the title property\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino': {'taglineEmbedding': [0.002433443209156394,\n",
       "    -0.03343634307384491,\n",
       "    0.019985364750027657,\n",
       "    -0.012390679679811,\n",
       "    -0.006645349785685539,\n",
       "    0.019714126363396645,\n",
       "    -0.02079908177256584,\n",
       "    0.0028942408971488476,\n",
       "    -0.008180314674973488,\n",
       "    -0.006118283607065678,\n",
       "    0.020083997398614883,\n",
       "    0.015041422098875046,\n",
       "    0.011213256977498531,\n",
       "    0.006873436737805605,\n",
       "    -0.010023505426943302,\n",
       "    -0.011052979156374931,\n",
       "    0.0235607847571373,\n",
       "    0.011453673243522644,\n",
       "    0.004808323457837105,\n",
       "    -0.026680029928684235,\n",
       "    -0.007175498176366091,\n",
       "    0.004379889462143183,\n",
       "    -0.00926526915282011,\n",
       "    0.011694089509546757,\n",
       "    -0.002908111084252596,\n",
       "    0.0027863618452101946,\n",
       "    0.022673094645142555,\n",
       "    -0.0235607847571373,\n",
       "    0.04608593136072159,\n",
       "    -0.01951686106622219,\n",
       "    0.04068581387400627,\n",
       "    0.015288002789020538,\n",
       "    0.00847004633396864,\n",
       "    -0.030896561220288277,\n",
       "    -0.04016799479722977,\n",
       "    -0.006910423748195171,\n",
       "    -0.02552110143005848,\n",
       "    -0.020762093365192413,\n",
       "    0.005131960846483707,\n",
       "    -0.002709305379539728,\n",
       "    0.004361396189779043,\n",
       "    -0.011484495364129543,\n",
       "    -0.0061891754157841206,\n",
       "    -0.014942789450287819,\n",
       "    -0.04468042030930519,\n",
       "    0.009326914325356483,\n",
       "    0.009931037202477455,\n",
       "    -0.022377198562026024,\n",
       "    -0.00926526915282011,\n",
       "    -0.0021421697456389666,\n",
       "    0.012809867039322853,\n",
       "    0.00959815364331007,\n",
       "    -0.011034485884010792,\n",
       "    -0.03375689685344696,\n",
       "    0.005489502567797899,\n",
       "    -0.014203047379851341,\n",
       "    -0.011268737725913525,\n",
       "    0.014252363704144955,\n",
       "    -0.006139859091490507,\n",
       "    0.013993454165756702,\n",
       "    0.006633020471781492,\n",
       "    -0.004386053886264563,\n",
       "    -0.00035523029509931803,\n",
       "    -0.0010418033925816417,\n",
       "    0.01391948014497757,\n",
       "    0.0012984015047550201,\n",
       "    -0.021773075684905052,\n",
       "    0.019097674638032913,\n",
       "    0.0027247166726738214,\n",
       "    0.000768638274166733,\n",
       "    0.024374501779675484,\n",
       "    0.023721061646938324,\n",
       "    0.022426513954997063,\n",
       "    0.0064665786921978,\n",
       "    -0.005458679981529713,\n",
       "    -0.004999423399567604,\n",
       "    -0.020022351294755936,\n",
       "    0.011151611804962158,\n",
       "    -0.002923522377386689,\n",
       "    -0.0036987103521823883,\n",
       "    0.012224237434566021,\n",
       "    -0.009807746857404709,\n",
       "    -0.03602543845772743,\n",
       "    0.0046048942022025585,\n",
       "    0.019023699685931206,\n",
       "    0.0011581586441025138,\n",
       "    -0.01356193795800209,\n",
       "    0.013315357267856598,\n",
       "    -0.021021004766225815,\n",
       "    -0.002367174718528986,\n",
       "    0.007785785477608442,\n",
       "    0.012489312328398228,\n",
       "    0.017346952110528946,\n",
       "    0.022253908216953278,\n",
       "    -0.019036028534173965,\n",
       "    0.013056447729468346,\n",
       "    -0.01949220336973667,\n",
       "    0.013438647612929344,\n",
       "    0.01023926306515932,\n",
       "    -0.03501445800065994,\n",
       "    0.006235409062355757,\n",
       "    -0.0066885012201964855,\n",
       "    -0.005936430301517248,\n",
       "    -0.007138511165976524,\n",
       "    0.002066654385998845,\n",
       "    0.0012575614964589477,\n",
       "    -0.011903682723641396,\n",
       "    0.002824889961630106,\n",
       "    -0.002992873080074787,\n",
       "    0.014178389683365822,\n",
       "    0.007095359265804291,\n",
       "    0.014400312677025795,\n",
       "    0.027740327641367912,\n",
       "    -0.02018263004720211,\n",
       "    0.0013839341700077057,\n",
       "    -0.01456058956682682,\n",
       "    -0.013105764053761959,\n",
       "    -0.01949220336973667,\n",
       "    0.006706994958221912,\n",
       "    -0.025089586153626442,\n",
       "    0.02882528305053711,\n",
       "    0.0013492587022483349,\n",
       "    0.012674247846007347,\n",
       "    -0.017112700268626213,\n",
       "    0.009055675938725471,\n",
       "    0.0001777114812284708,\n",
       "    -0.03563091158866882,\n",
       "    -0.016003087162971497,\n",
       "    0.004863804206252098,\n",
       "    0.019627822563052177,\n",
       "    0.023449823260307312,\n",
       "    0.032597966492176056,\n",
       "    -0.012298212386667728,\n",
       "    -0.015793493017554283,\n",
       "    -0.010134465992450714,\n",
       "    0.006706994958221912,\n",
       "    -0.00023983824939932674,\n",
       "    -0.018160667270421982,\n",
       "    -0.011916011571884155,\n",
       "    -0.011040650308132172,\n",
       "    0.013475635088980198,\n",
       "    -0.00211442937143147,\n",
       "    -0.0006384128355421126,\n",
       "    -0.0012829902116209269,\n",
       "    0.013660570606589317,\n",
       "    0.01141052134335041,\n",
       "    -0.014240034855902195,\n",
       "    0.008130998350679874,\n",
       "    0.005563477054238319,\n",
       "    0.0041209799237549305,\n",
       "    0.0025536513421684504,\n",
       "    -0.012772879563272,\n",
       "    0.016385287046432495,\n",
       "    -0.01622501015663147,\n",
       "    -0.003624736098572612,\n",
       "    0.016705842688679695,\n",
       "    -0.002544404473155737,\n",
       "    -0.007206320762634277,\n",
       "    -0.02352379821240902,\n",
       "    -0.011663266457617283,\n",
       "    -0.005834715440869331,\n",
       "    0.009148143231868744,\n",
       "    0.023745721206068993,\n",
       "    0.012538627721369267,\n",
       "    0.004345984663814306,\n",
       "    0.018086694180965424,\n",
       "    0.006065885070711374,\n",
       "    0.02153882384300232,\n",
       "    -0.004265845753252506,\n",
       "    0.03318976238369942,\n",
       "    0.0040500876493752,\n",
       "    0.02653208188712597,\n",
       "    -0.02917049638926983,\n",
       "    0.012871512211859226,\n",
       "    -0.0013184361159801483,\n",
       "    0.027740327641367912,\n",
       "    -0.014992105774581432,\n",
       "    0.028578702360391617,\n",
       "    -0.012020808644592762,\n",
       "    -0.024053946137428284,\n",
       "    -0.008685804903507233,\n",
       "    -0.001389328041113913,\n",
       "    0.0325239934027195,\n",
       "    0.04958737641572952,\n",
       "    -0.006090543232858181,\n",
       "    -0.004154884722083807,\n",
       "    0.02252514660358429,\n",
       "    0.012446160428225994,\n",
       "    0.008020036853849888,\n",
       "    -0.003877481445670128,\n",
       "    0.01077557634562254,\n",
       "    0.02052784338593483,\n",
       "    -0.0072556366212666035,\n",
       "    0.007563862483948469,\n",
       "    -0.6813517808914185,\n",
       "    -0.013672899454832077,\n",
       "    0.00020381435751914978,\n",
       "    0.009647469967603683,\n",
       "    0.014856486581265926,\n",
       "    -0.003895974950864911,\n",
       "    0.0018693899037316442,\n",
       "    0.015645544975996017,\n",
       "    -0.00958582479506731,\n",
       "    0.0028141022194176912,\n",
       "    -0.008346755988895893,\n",
       "    0.0047528427094221115,\n",
       "    -0.005353883374482393,\n",
       "    -0.0035877490881830454,\n",
       "    -0.034940484911203384,\n",
       "    -0.025743024423718452,\n",
       "    0.002690811874344945,\n",
       "    -0.025915630161762238,\n",
       "    0.012544793076813221,\n",
       "    0.004888462368398905,\n",
       "    -0.003449047449976206,\n",
       "    0.022623779252171516,\n",
       "    -0.007970720529556274,\n",
       "    0.008932385593652725,\n",
       "    0.010196111164987087,\n",
       "    0.013438647612929344,\n",
       "    0.0023594689555466175,\n",
       "    -0.005702178459614515,\n",
       "    -0.017667505890130997,\n",
       "    0.011114624328911304,\n",
       "    1.681998219282832e-05,\n",
       "    0.020404553040862083,\n",
       "    -0.007440572138875723,\n",
       "    0.021760746836662292,\n",
       "    0.043521493673324585,\n",
       "    -0.022771727293729782,\n",
       "    -0.010713931173086166,\n",
       "    0.016052402555942535,\n",
       "    0.006996727082878351,\n",
       "    0.017334623262286186,\n",
       "    -0.013870163820683956,\n",
       "    -0.0032702763564884663,\n",
       "    0.019368913024663925,\n",
       "    -0.012526298873126507,\n",
       "    0.010750917717814445,\n",
       "    -0.007422078866511583,\n",
       "    -0.005162783432751894,\n",
       "    -0.020762093365192413,\n",
       "    -0.00023714127019047737,\n",
       "    -0.005168947856873274,\n",
       "    0.004077828023582697,\n",
       "    0.01592911221086979,\n",
       "    -0.01354960910975933,\n",
       "    0.001130418386310339,\n",
       "    -0.005094973370432854,\n",
       "    0.01891273818910122,\n",
       "    -0.0037017925642430782,\n",
       "    -0.005803892854601145,\n",
       "    -0.016520906239748,\n",
       "    0.020318249240517616,\n",
       "    -0.0035384329967200756,\n",
       "    0.009363901801407337,\n",
       "    -0.011120788753032684,\n",
       "    0.0012436913093551993,\n",
       "    -0.02685263752937317,\n",
       "    0.030625320971012115,\n",
       "    -0.02152649499475956,\n",
       "    0.038959749042987823,\n",
       "    0.020786752924323082,\n",
       "    -0.0274690892547369,\n",
       "    -0.011083802208304405,\n",
       "    0.0069843982346355915,\n",
       "    0.007409749552607536,\n",
       "    -0.016101719811558723,\n",
       "    0.006589869037270546,\n",
       "    0.01653323508799076,\n",
       "    0.01358659565448761,\n",
       "    -0.0033072635997086763,\n",
       "    0.0067686401307582855,\n",
       "    0.014005783013999462,\n",
       "    -0.0037110394332557917,\n",
       "    -0.017975732684135437,\n",
       "    -0.0032795232255011797,\n",
       "    0.010541324503719807,\n",
       "    0.01490580290555954,\n",
       "    -0.0005786940455436707,\n",
       "    -0.030378740280866623,\n",
       "    -0.029343102127313614,\n",
       "    -0.02124292589724064,\n",
       "    0.005711425095796585,\n",
       "    0.0019942212384194136,\n",
       "    0.030748611316084862,\n",
       "    0.01043036300688982,\n",
       "    0.00256289797835052,\n",
       "    0.01586746796965599,\n",
       "    -0.0048360638320446014,\n",
       "    -0.022426513954997063,\n",
       "    -0.0008345215464942157,\n",
       "    0.02015797235071659,\n",
       "    -0.025077255442738533,\n",
       "    -0.008309769444167614,\n",
       "    -0.012353692203760147,\n",
       "    0.004829899407923222,\n",
       "    0.003464458743110299,\n",
       "    0.017334623262286186,\n",
       "    0.013155079446732998,\n",
       "    -0.00041571963811293244,\n",
       "    0.008642653003334999,\n",
       "    0.05409980192780495,\n",
       "    -0.017162015661597252,\n",
       "    0.0063371239230036736,\n",
       "    -0.013882492668926716,\n",
       "    -0.000999422394670546,\n",
       "    0.003929879982024431,\n",
       "    -0.014992105774581432,\n",
       "    -0.019134661182761192,\n",
       "    0.016681183129549026,\n",
       "    -0.0033935667015612125,\n",
       "    -0.010128301568329334,\n",
       "    -0.021958010271191597,\n",
       "    0.007015220820903778,\n",
       "    0.013093434274196625,\n",
       "    0.016964752227067947,\n",
       "    -0.02123059704899788,\n",
       "    0.023918326944112778,\n",
       "    0.020774424076080322,\n",
       "    0.007983050309121609,\n",
       "    0.009055675938725471,\n",
       "    -0.022956661880016327,\n",
       "    0.013093434274196625,\n",
       "    -0.015485267154872417,\n",
       "    0.011879025027155876,\n",
       "    0.04645580053329468,\n",
       "    0.006355617195367813,\n",
       "    0.03237604349851608,\n",
       "    -0.0015827397583052516,\n",
       "    -0.004382971674203873,\n",
       "    -0.01759353280067444,\n",
       "    0.02946639247238636,\n",
       "    -0.012057796120643616,\n",
       "    0.006318630184978247,\n",
       "    -0.017285306006669998,\n",
       "    -0.017051054164767265,\n",
       "    0.011965327896177769,\n",
       "    -0.023708732798695564,\n",
       "    -0.030921218916773796,\n",
       "    -0.029589682817459106,\n",
       "    0.01174340583384037,\n",
       "    -0.006355617195367813,\n",
       "    0.001111924764700234,\n",
       "    0.003621653886511922,\n",
       "    0.004894626792520285,\n",
       "    0.0043336558155715466,\n",
       "    0.015177041292190552,\n",
       "    0.005002505611628294,\n",
       "    0.0050333281978964806,\n",
       "    -0.009900215081870556,\n",
       "    -0.0168414618819952,\n",
       "    -0.04512426629662514,\n",
       "    -0.019800430163741112,\n",
       "    -0.004601811990141869,\n",
       "    0.017112700268626213,\n",
       "    -0.019442887976765633,\n",
       "    -0.00619842205196619,\n",
       "    0.008124833926558495,\n",
       "    -0.02421422302722931,\n",
       "    -0.0020312084816396236,\n",
       "    0.002713928697630763,\n",
       "    0.008537856861948967,\n",
       "    -0.002604508539661765,\n",
       "    -0.004296668339520693,\n",
       "    -0.01822231337428093,\n",
       "    0.0006322482950054109,\n",
       "    0.00744673702865839,\n",
       "    -0.0025074174627661705,\n",
       "    0.0032209602650254965,\n",
       "    -0.011922175996005535,\n",
       "    0.012698905542492867,\n",
       "    0.006645349785685539,\n",
       "    0.00034039694583043456,\n",
       "    0.010091315023601055,\n",
       "    -0.004204200580716133,\n",
       "    0.007508382201194763,\n",
       "    -0.02783896028995514,\n",
       "    0.04808323457837105,\n",
       "    0.018283957615494728,\n",
       "    -0.0076871528290212154,\n",
       "    -3.452490773270256e-06,\n",
       "    -0.012970143929123878,\n",
       "    0.021736087277531624,\n",
       "    0.002453477820381522,\n",
       "    0.01587979681789875,\n",
       "    0.0010402622865512967,\n",
       "    -0.019344255328178406,\n",
       "    0.028332121670246124,\n",
       "    -0.025299178436398506,\n",
       "    0.005603546276688576,\n",
       "    -0.007514546625316143,\n",
       "    0.00827278196811676,\n",
       "    0.020959358662366867,\n",
       "    0.003939126618206501,\n",
       "    0.009949530474841595,\n",
       "    -0.009968024678528309,\n",
       "    -0.01890040934085846,\n",
       "    -0.0019294938538223505,\n",
       "    -0.03284454718232155,\n",
       "    -0.0049007912166416645,\n",
       "    -0.021045662462711334,\n",
       "    0.014412641525268555,\n",
       "    0.023067623376846313,\n",
       "    0.00314082158729434,\n",
       "    -0.010115972720086575,\n",
       "    0.013660570606589317,\n",
       "    -0.017001738771796227,\n",
       "    0.00048160291044041514,\n",
       "    0.057157404720783234,\n",
       "    0.010128301568329334,\n",
       "    0.012994802556931973,\n",
       "    -0.013130421750247478,\n",
       "    -0.0021868625190109015,\n",
       "    -0.0029373925644904375,\n",
       "    -0.003892892738804221,\n",
       "    0.00439221877604723,\n",
       "    -0.016311312094330788,\n",
       "    0.016668854281306267,\n",
       "    0.00861799530684948,\n",
       "    0.0172236617654562,\n",
       "    0.001218262710608542,\n",
       "    0.006019650958478451,\n",
       "    -0.02222924865782261,\n",
       "    -0.019405899569392204,\n",
       "    0.005316896364092827,\n",
       "    0.015361976809799671,\n",
       "    0.0010140631347894669,\n",
       "    0.003923715092241764,\n",
       "    0.017408596351742744,\n",
       "    0.0188880804926157,\n",
       "    -0.008389907889068127,\n",
       "    0.028011566027998924,\n",
       "    -0.00255981576628983,\n",
       "    -0.00264303688891232,\n",
       "    -0.005153536330908537,\n",
       "    -0.00620766868814826,\n",
       "    -0.014955119229853153,\n",
       "    0.017371609807014465,\n",
       "    -0.00959815364331007,\n",
       "    0.023005979135632515,\n",
       "    0.017778467386960983,\n",
       "    -0.032967839390039444,\n",
       "    0.022673094645142555,\n",
       "    -0.01340166013687849,\n",
       "    0.02019495889544487,\n",
       "    0.0008661146857775748,\n",
       "    -0.005335389636456966,\n",
       "    0.0045370846055448055,\n",
       "    -0.026334818452596664,\n",
       "    0.015744177624583244,\n",
       "    -0.005671355873346329,\n",
       "    -0.00422885874286294,\n",
       "    0.02383202314376831,\n",
       "    0.005057986360043287,\n",
       "    0.014252363704144955,\n",
       "    0.0022916593588888645,\n",
       "    -0.017667505890130997,\n",
       "    0.012218073010444641,\n",
       "    -0.0028911586850881577,\n",
       "    9.50684116105549e-05,\n",
       "    -0.013229054398834705,\n",
       "    0.0007443654467351735,\n",
       "    -0.020774424076080322,\n",
       "    -0.024571765214204788,\n",
       "    0.005720672197639942,\n",
       "    0.028948573395609856,\n",
       "    0.005159700755029917,\n",
       "    0.021785404533147812,\n",
       "    -0.026951270177960396,\n",
       "    -0.014992105774581432,\n",
       "    -0.0271485336124897,\n",
       "    -0.0003128492389805615,\n",
       "    0.0086118308827281,\n",
       "    0.006078213918954134,\n",
       "    -0.030649980530142784,\n",
       "    -0.0010032751597464085,\n",
       "    0.02882528305053711,\n",
       "    0.0004484686360228807,\n",
       "    -0.04778733849525452,\n",
       "    -0.010134465992450714,\n",
       "    0.00727413035929203,\n",
       "    -0.009900215081870556,\n",
       "    0.008383743464946747,\n",
       "    -0.01818532682955265,\n",
       "    -0.01885109394788742,\n",
       "    -0.011533811688423157,\n",
       "    0.007169333752244711,\n",
       "    0.0026599892880767584,\n",
       "    0.010177617892622948,\n",
       "    0.005914854351431131,\n",
       "    -0.021033333614468575,\n",
       "    -0.008198807947337627,\n",
       "    9.468313510296866e-05,\n",
       "    0.01409208681434393,\n",
       "    -0.0017830865690484643,\n",
       "    0.01820998452603817,\n",
       "    -0.002390291541814804,\n",
       "    0.003079176414757967,\n",
       "    0.008211136795580387,\n",
       "    -0.007847430184483528,\n",
       "    -0.018678488209843636,\n",
       "    -0.03915701434016228,\n",
       "    0.010633792728185654,\n",
       "    -0.013635911978781223,\n",
       "    -0.025249863043427467,\n",
       "    -0.0047559249214828014,\n",
       "    -0.023277217522263527,\n",
       "    -0.00078674650285393,\n",
       "    -0.015312660485506058,\n",
       "    0.00942554697394371,\n",
       "    -0.014437299221754074,\n",
       "    0.03868851065635681,\n",
       "    -0.004777500871568918,\n",
       "    -0.019603164866566658,\n",
       "    0.015226357616484165,\n",
       "    -0.03910769894719124,\n",
       "    0.00048160291044041514,\n",
       "    0.12210676074028015,\n",
       "    0.018037376925349236,\n",
       "    -0.01820998452603817,\n",
       "    0.014227706007659435,\n",
       "    -0.020120983943343163,\n",
       "    -0.004783665295690298,\n",
       "    0.0006942787440493703,\n",
       "    -0.01595376990735531,\n",
       "    0.0020759012550115585,\n",
       "    -0.004663457162678242,\n",
       "    -0.004792912397533655,\n",
       "    -0.015053750947117805,\n",
       "    -0.00013070703425910324,\n",
       "    -0.008716627024114132,\n",
       "    0.028011566027998924,\n",
       "    0.01157696358859539,\n",
       "    0.001165093737654388,\n",
       "    -0.0029851675499230623,\n",
       "    -0.00159352773334831,\n",
       "    0.00845771748572588,\n",
       "    -0.023992301896214485,\n",
       "    -0.0071878270246088505,\n",
       "    0.019960707053542137,\n",
       "    0.0033750731963664293,\n",
       "    -0.017457913607358932,\n",
       "    0.020096326246857643,\n",
       "    0.0023563867434859276,\n",
       "    0.011466002091765404,\n",
       "    -0.002589097246527672,\n",
       "    -0.005668273661285639,\n",
       "    0.0074035851284861565,\n",
       "    0.004879215266555548,\n",
       "    0.007397420704364777,\n",
       "    0.027321141213178635,\n",
       "    -0.014412641525268555,\n",
       "    0.004678868688642979,\n",
       "    -0.01194067019969225,\n",
       "    -0.0003105375508312136,\n",
       "    0.04894626885652542,\n",
       "    -0.02877596579492092,\n",
       "    0.00745906587690115,\n",
       "    -0.007563862483948469,\n",
       "    0.018160667270421982,\n",
       "    0.007027549669146538,\n",
       "    0.00945636909455061,\n",
       "    0.016064731404185295,\n",
       "    -0.009209788404405117,\n",
       "    0.01457291841506958,\n",
       "    -0.03220343962311745,\n",
       "    -0.025743024423718452,\n",
       "    0.01595376990735531,\n",
       "    -0.007995379157364368,\n",
       "    -0.01274822186678648,\n",
       "    -0.0059764995239675045,\n",
       "    0.02118128165602684,\n",
       "    0.019282609224319458,\n",
       "    0.00530456705018878,\n",
       "    -0.01595376990735531,\n",
       "    -0.029269127175211906,\n",
       "    -0.0019788099452853203,\n",
       "    -0.02786361798644066,\n",
       "    -0.022759398445487022,\n",
       "    -0.01723599061369896,\n",
       "    -0.015177041292190552,\n",
       "    -0.00318705546669662,\n",
       "    -0.014240034855902195,\n",
       "    -0.01623733900487423,\n",
       "    -0.007033714093267918,\n",
       "    -0.019997693598270416,\n",
       "    -0.02751840464770794,\n",
       "    0.03299249708652496,\n",
       "    -0.0298362635076046,\n",
       "    0.0023517634253948927,\n",
       "    -0.006343288347125053,\n",
       "    0.011311889626085758,\n",
       "    0.024953965097665787,\n",
       "    0.013413989916443825,\n",
       "    -0.0038189184851944447,\n",
       "    -0.011163940653204918,\n",
       "    -0.0053970348089933395,\n",
       "    0.005816222168505192,\n",
       "    -0.031586986035108566,\n",
       "    -0.02148950658738613,\n",
       "    -0.020022351294755936,\n",
       "    -0.01827162876725197,\n",
       "    -0.002325564157217741,\n",
       "    0.011305724270641804,\n",
       "    0.0071200174279510975,\n",
       "    -0.018136009573936462,\n",
       "    0.005168947856873274,\n",
       "    0.017951074987649918,\n",
       "    0.003205548971891403,\n",
       "    0.005924100987613201,\n",
       "    0.004456946160644293,\n",
       "    -0.00924677588045597,\n",
       "    -0.02213061787188053,\n",
       "    0.0150784095749259,\n",
       "    0.00961048249155283,\n",
       "    0.01595376990735531,\n",
       "    0.018999041989445686,\n",
       "    0.0002856868377421051,\n",
       "    -0.01751955784857273,\n",
       "    -0.01791408658027649,\n",
       "    -0.0027046820614486933,\n",
       "    0.018727803602814674,\n",
       "    0.008038530126214027,\n",
       "    0.030723953619599342,\n",
       "    0.0005405510892160237,\n",
       "    -0.0022084382362663746,\n",
       "    -0.001022539334371686,\n",
       "    0.003581584431231022,\n",
       "    -0.016804473474621773,\n",
       "    -0.0032425359822809696,\n",
       "    -0.017741480842232704,\n",
       "    -0.00531381368637085,\n",
       "    0.004521673545241356,\n",
       "    0.02452244982123375,\n",
       "    0.03977346420288086,\n",
       "    0.0012205743696540594,\n",
       "    -0.0038065894041210413,\n",
       "    -0.025089586153626442,\n",
       "    -0.021119635552167892,\n",
       "    0.015608557499945164,\n",
       "    0.022303223609924316,\n",
       "    0.002003468107432127,\n",
       "    -0.016903106123209,\n",
       "    0.006811791565269232,\n",
       "    -0.007224814034998417,\n",
       "    -0.014511273242533207,\n",
       "    -0.0038250829093158245,\n",
       "    0.013956466689705849,\n",
       "    0.02047852613031864,\n",
       "    -0.00808784645050764,\n",
       "    -0.037924110889434814,\n",
       "    -0.034595269709825516,\n",
       "    0.0025074174627661705,\n",
       "    -0.013820847496390343,\n",
       "    -0.0026846472173929214,\n",
       "    -0.01891273818910122,\n",
       "    -0.013303028419613838,\n",
       "    -0.0016859954921528697,\n",
       "    -0.014350996352732182,\n",
       "    0.00646041426807642,\n",
       "    -0.01617569290101528,\n",
       "    -0.011003663763403893,\n",
       "    -0.02611289545893669,\n",
       "    -0.0034767878241837025,\n",
       "    -0.0014216918498277664,\n",
       "    0.007391256280243397,\n",
       "    0.011959163472056389,\n",
       "    0.003772684605792165,\n",
       "    -0.005837797652930021,\n",
       "    -0.025767682120203972,\n",
       "    0.011096131056547165,\n",
       "    0.030206134542822838,\n",
       "    -0.010066656395792961,\n",
       "    0.00011625893966993317,\n",
       "    -0.019393570721149445,\n",
       "    0.006349452771246433,\n",
       "    0.019997693598270416,\n",
       "    0.02412792108952999,\n",
       "    -0.003994607366621494,\n",
       "    -0.010541324503719807,\n",
       "    0.0011173187522217631,\n",
       "    0.013093434274196625,\n",
       "    0.0010233098873868585,\n",
       "    -0.030280109494924545,\n",
       "    -0.006130612455308437,\n",
       "    -0.01724831946194172,\n",
       "    0.014782512560486794,\n",
       "    -0.007576191797852516,\n",
       "    0.0061244480311870575,\n",
       "    0.00020959359244443476,\n",
       "    -0.013179738074541092,\n",
       "    0.0025690626353025436,\n",
       "    0.014819499105215073,\n",
       "    -0.005609710700809956,\n",
       "    -0.0023610100615769625,\n",
       "    -0.036247361451387405,\n",
       "    -0.028677335008978844,\n",
       "    -0.008593336679041386,\n",
       "    -0.035236380994319916,\n",
       "    -0.02685263752937317,\n",
       "    0.004191871732473373,\n",
       "    0.0009647469269111753,\n",
       "    -0.017038725316524506,\n",
       "    0.021908694878220558,\n",
       "    0.01717434450984001,\n",
       "    0.011256408877670765,\n",
       "    0.03047737292945385,\n",
       "    0.01891273818910122,\n",
       "    0.007989214733242989,\n",
       "    0.016767486929893494,\n",
       "    0.0038281651213765144,\n",
       "    -0.02447313442826271,\n",
       "    -0.03018147684633732,\n",
       "    0.0009763053967617452,\n",
       "    -0.0015226358082145452,\n",
       "    0.008864575996994972,\n",
       "    -0.008007708005607128,\n",
       "    -0.012433831579983234,\n",
       "    0.01825929991900921,\n",
       "    -0.019073016941547394,\n",
       "    -0.003516857046633959,\n",
       "    0.006435756105929613,\n",
       "    0.013315357267856598,\n",
       "    -0.028701992705464363,\n",
       "    -0.04645580053329468,\n",
       "    0.017482571303844452,\n",
       "    -0.023400507867336273,\n",
       "    0.01887575164437294,\n",
       "    -0.02813485637307167,\n",
       "    -0.015694860368967056,\n",
       "    -0.0192702803760767,\n",
       "    -0.00744673702865839,\n",
       "    0.008747450076043606,\n",
       "    -0.0311184823513031,\n",
       "    -0.0002722019562497735,\n",
       "    -0.021699100732803345,\n",
       "    -0.02978694811463356,\n",
       "    0.012285882607102394,\n",
       "    0.003744944231584668,\n",
       "    0.04532153159379959,\n",
       "    0.009209788404405117,\n",
       "    0.033608946949243546,\n",
       "    0.01057831197977066,\n",
       "    -0.007348104380071163,\n",
       "    -0.015029093250632286,\n",
       "    0.011028321459889412,\n",
       "    0.015029093250632286,\n",
       "    -0.0009947989601641893,\n",
       "    0.04078444465994835,\n",
       "    -0.0023548456374555826,\n",
       "    0.011527647264301777,\n",
       "    0.01257561519742012,\n",
       "    0.008229630999267101,\n",
       "    0.013845506124198437,\n",
       "    0.0002542863367125392,\n",
       "    -0.019393570721149445,\n",
       "    0.014030441641807556,\n",
       "    0.0034983635414391756,\n",
       "    -0.007650165818631649,\n",
       "    -0.00995569583028555,\n",
       "    -0.012020808644592762,\n",
       "    0.02124292589724064,\n",
       "    0.020416881889104843,\n",
       "    -0.00030398776289075613,\n",
       "    -0.005360047798603773,\n",
       "    0.00045655955909751356,\n",
       "    -0.00827278196811676,\n",
       "    -0.007150840014219284,\n",
       "    -0.008476211689412594,\n",
       "    -0.02677866257727146,\n",
       "    0.02079908177256584,\n",
       "    0.020984016358852386,\n",
       "    -0.008587172254920006,\n",
       "    -0.006454249378293753,\n",
       "    -0.025619734078645706,\n",
       "    0.00646041426807642,\n",
       "    0.013672899454832077,\n",
       "    -0.022981319576501846,\n",
       "    0.018012719228863716,\n",
       "    -0.007132346276193857,\n",
       "    6.020036380505189e-05,\n",
       "    -0.01750722900032997,\n",
       "    0.018025048077106476,\n",
       "    -0.02084839716553688,\n",
       "    -0.002001927001401782,\n",
       "    -0.01955384947359562,\n",
       "    0.022759398445487022,\n",
       "    -0.0031130812130868435,\n",
       "    -0.021748416125774384,\n",
       "    -0.0013430941617116332,\n",
       "    -0.0030899643898010254,\n",
       "    -0.0003421307192184031,\n",
       "    -0.0012105570640414953,\n",
       "    -0.0024057028349488974,\n",
       "    -0.022673094645142555,\n",
       "    0.016434602439403534,\n",
       "    -0.014030441641807556,\n",
       "    0.012248896062374115,\n",
       "    0.02320324257016182,\n",
       "    -0.0043367380276322365,\n",
       "    -0.0034983635414391756,\n",
       "    -0.02579233981668949,\n",
       "    -0.031586986035108566,\n",
       "    -0.011694089509546757,\n",
       "    0.0036031603813171387,\n",
       "    0.016003087162971497,\n",
       "    -0.017063383013010025,\n",
       "    0.0008953961078077555,\n",
       "    -0.001407821662724018,\n",
       "    0.01142901461571455,\n",
       "    0.009111156687140465,\n",
       "    0.005837797652930021,\n",
       "    -0.0235607847571373,\n",
       "    -0.004006936214864254,\n",
       "    0.005104220472276211,\n",
       "    -0.010017341002821922,\n",
       "    0.012113276869058609,\n",
       "    -0.008581007830798626,\n",
       "    -0.009123485535383224,\n",
       "    -0.006004239898175001,\n",
       "    0.005677520297467709,\n",
       "    0.0013615877833217382,\n",
       "    0.004500097595155239,\n",
       "    0.012649589218199253,\n",
       "    -0.016397615894675255,\n",
       "    -0.01157079916447401,\n",
       "    -0.0025675215292721987,\n",
       "    -0.005242921877652407,\n",
       "    0.009191295132040977,\n",
       "    -0.006873436737805605,\n",
       "    0.0049686008132994175,\n",
       "    -0.0028510892298072577,\n",
       "    -0.0024103261530399323,\n",
       "    -0.00013147760182619095,\n",
       "    -0.023979973047971725,\n",
       "    0.0013739167479798198,\n",
       "    0.013093434274196625,\n",
       "    -0.01194683462381363,\n",
       "    0.012372186407446861,\n",
       "    0.026680029928684235,\n",
       "    -0.008556350134313107,\n",
       "    -0.00031843583565205336,\n",
       "    0.013968796469271183,\n",
       "    -0.005754576995968819,\n",
       "    -0.011256408877670765,\n",
       "    -0.018370261415839195,\n",
       "    -0.013290699571371078,\n",
       "    -0.016730500385165215,\n",
       "    0.007058372255414724,\n",
       "    -0.006830285303294659,\n",
       "    -0.032326728105545044,\n",
       "    -0.017433254048228264,\n",
       "    -0.009080333635210991,\n",
       "    -0.007841265760362148,\n",
       "    0.030551347881555557,\n",
       "    -0.007847430184483528,\n",
       "    -0.011311889626085758,\n",
       "    -0.0024473133962601423,\n",
       "    0.03550761938095093,\n",
       "    0.0063247946090996265,\n",
       "    -0.006164517253637314,\n",
       "    0.01723599061369896,\n",
       "    0.00273550464771688,\n",
       "    0.015337319113314152,\n",
       "    -0.016077060252428055,\n",
       "    -0.0038189184851944447,\n",
       "    -0.02123059704899788,\n",
       "    -0.013882492668926716,\n",
       "    0.007175498176366091,\n",
       "    0.01025775633752346,\n",
       "    -0.01039954088628292,\n",
       "    -0.011311889626085758,\n",
       "    0.006910423748195171,\n",
       "    -0.04278175160288811,\n",
       "    -0.005443268921226263,\n",
       "    0.0056929318234324455,\n",
       "    0.001764593063853681,\n",
       "    0.023400507867336273,\n",
       "    0.020688120275735855,\n",
       "    0.0030021199490875006,\n",
       "    -0.0012629554839804769,\n",
       "    0.008137162774801254,\n",
       "    0.010122137144207954,\n",
       "    -0.005446351133286953,\n",
       "    0.010134465992450714,\n",
       "    -0.012144098989665508,\n",
       "    0.014424970373511314,\n",
       "    0.02712387591600418,\n",
       "    0.011361205019056797,\n",
       "    -7.869391265558079e-05,\n",
       "    0.0036463120486587286,\n",
       "    -0.0010880372719839215,\n",
       "    0.01989906094968319,\n",
       "    0.00719399144873023,\n",
       "    0.014412641525268555,\n",
       "    -0.0006719323573634028,\n",
       "    0.011299559846520424,\n",
       "    0.013944137841463089,\n",
       "    0.005150454118847847,\n",
       "    0.018801778554916382,\n",
       "    0.025052597746253014,\n",
       "    0.0199113916605711,\n",
       "    -0.03180890902876854,\n",
       "    0.02025660313665867,\n",
       "    0.009302256628870964,\n",
       "    -0.017038725316524506,\n",
       "    -0.02118128165602684,\n",
       "    -0.016286654397845268,\n",
       "    0.010393376462161541,\n",
       "    0.004456946160644293,\n",
       "    0.018394919112324715,\n",
       "    -0.0033072635997086763,\n",
       "    -0.01062146294862032,\n",
       "    -0.011983821168541908,\n",
       "    -0.0211936105042696,\n",
       "    0.025767682120203972,\n",
       "    0.014042770490050316,\n",
       "    0.009844734333455563,\n",
       "    0.03050203062593937,\n",
       "    0.010522831231355667,\n",
       "    -0.019738784059882164,\n",
       "    -0.005344636272639036,\n",
       "    -0.003208631183952093,\n",
       "    0.0015858220867812634,\n",
       "    0.0005085726734250784,\n",
       "    0.006910423748195171,\n",
       "    -0.017014067620038986,\n",
       "    -0.015497596003115177,\n",
       "    -0.002394914859905839,\n",
       "    -0.005360047798603773,\n",
       "    -0.013894821517169476,\n",
       "    0.008241959847509861,\n",
       "    0.011687925085425377,\n",
       "    -0.013709885999560356,\n",
       "    -0.02314159832894802,\n",
       "    0.0086118308827281,\n",
       "    0.028282804414629936,\n",
       "    -0.00511963153257966,\n",
       "    0.009326914325356483,\n",
       "    -0.004382971674203873,\n",
       "    -0.0014263151679188013,\n",
       "    -0.008704298175871372,\n",
       "    -0.018456565216183662,\n",
       "    -0.017383938655257225,\n",
       "    -0.006559046451002359,\n",
       "    0.0012637260369956493,\n",
       "    -0.003954537678509951,\n",
       "    -0.001251396955922246,\n",
       "    -0.0020851478911936283,\n",
       "    -0.015744177624583244,\n",
       "    0.0025521102361381054,\n",
       "    0.0019649399910122156,\n",
       "    0.0457160584628582,\n",
       "    0.23573113977909088,\n",
       "    -0.001963398652151227,\n",
       "    -0.021403204649686813,\n",
       "    0.034915827214717865,\n",
       "    -0.009049511514604092,\n",
       "    0.006534388288855553,\n",
       "    0.0028063964564353228,\n",
       "    0.002644577994942665,\n",
       "    -0.007150840014219284,\n",
       "    -0.0014895014464855194,\n",
       "    -0.01649624854326248,\n",
       "    -0.00859950203448534,\n",
       "    -0.012772879563272,\n",
       "    0.0003956849395763129,\n",
       "    0.006713159382343292,\n",
       "    -0.025915630161762238,\n",
       "    -0.010208440944552422,\n",
       "    -0.0019294938538223505,\n",
       "    -0.014338667504489422,\n",
       "    -0.0009901756420731544,\n",
       "    0.015398964285850525,\n",
       "    -0.01590445451438427,\n",
       "    -0.006965904496610165,\n",
       "    -0.004906955640763044,\n",
       "    0.036913130432367325,\n",
       "    -0.013142750598490238,\n",
       "    -0.015435950830578804,\n",
       "    0.01472086738795042,\n",
       "    0.008679640479385853,\n",
       "    -0.007150840014219284,\n",
       "    0.0012760551180690527,\n",
       "    0.00860566645860672,\n",
       "    0.006737817544490099,\n",
       "    0.017803125083446503,\n",
       "    -0.018136009573936462,\n",
       "    -0.006411097943782806,\n",
       "    0.022611448541283607,\n",
       "    -0.014831828884780407,\n",
       "    0.004423041362315416,\n",
       "    0.029638998210430145,\n",
       "    0.01918397843837738,\n",
       "    0.009499520994722843,\n",
       "    -4.9147576646646485e-05,\n",
       "    -0.012131770141422749,\n",
       "    0.01981275901198387,\n",
       "    0.02288268879055977,\n",
       "    ...],\n",
       "   'tagline': 'No one stays at the top forever.',\n",
       "   'imdbRating': 8.2,\n",
       "   'id': '16',\n",
       "   'title': 'Casino',\n",
       "   'released': neo4j.time.Date(1995, 11, 22)}}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released.year': 1995}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return only the released property of the matched Movie node\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released.year\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released': neo4j.time.Date(1995, 11, 22),\n",
       "  'Casino.tagline': 'No one stays at the top forever.'}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released, Casino.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.released': neo4j.time.Date(1995, 12, 22),\n",
       "  'm.tagline': 'Terror goes into overtime.'}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie {title:\"Sudden Death\"}) \n",
    "  RETURN m.released, m.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.title': 'Toy Story'},\n",
       " {'nineties.title': 'Jumanji'},\n",
       " {'nineties.title': 'Grumpier Old Men'},\n",
       " {'nineties.title': 'Waiting to Exhale'},\n",
       " {'nineties.title': 'Father of the Bride Part II'},\n",
       " {'nineties.title': 'Heat'},\n",
       " {'nineties.title': 'Sabrina'},\n",
       " {'nineties.title': 'Tom and Huck'},\n",
       " {'nineties.title': 'Sudden Death'},\n",
       " {'nineties.title': 'GoldenEye'},\n",
       " {'nineties.title': 'American President, The'},\n",
       " {'nineties.title': 'Dracula: Dead and Loving It'},\n",
       " {'nineties.title': 'Balto'},\n",
       " {'nineties.title': 'Nixon'},\n",
       " {'nineties.title': 'Cutthroat Island'},\n",
       " {'nineties.title': 'Casino'},\n",
       " {'nineties.title': 'Sense and Sensibility'},\n",
       " {'nineties.title': 'Four Rooms'},\n",
       " {'nineties.title': 'Ace Ventura: When Nature Calls'},\n",
       " {'nineties.title': 'Money Train'}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cypher patterns with conditional matching\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Movie) \n",
    "  WHERE nineties.released.year >= 1900\n",
    "    AND nineties.released.year < 2000\n",
    "  RETURN nineties.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'actor.name': 'Don Rickles', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tom Hanks', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tim Allen', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Jim Varney', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Kirsten Dunst', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Robin Williams', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Bradley Pierce', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Jonathan Hyde', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Sophia Loren', 'movie.title': 'Grumpier Old Men'},\n",
       " {'actor.name': 'Walter Matthau', 'movie.title': 'Grumpier Old Men'}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Pattern matching with multiple nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "  RETURN actor.name, movie.title LIMIT 10\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(tomHanksMovies:Movie) \n",
    "  RETURN tom.name,tomHanksMovies.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'coActors.name': 'Don Rickles', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Tim Allen', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Jim Varney', 'm.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) \n",
    "  RETURN coActors.name, m.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Delete/Add (Proceed with cautious)** "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete data from the graph\n",
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "RETURN emil.name, movie.title\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "DELETE actedIn\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'andreas': {'name': 'Andreas'}}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Adding data to the graph\n",
    "cypher = \"\"\"\n",
    "CREATE (andreas:Person {name:\"Andreas\"})\n",
    "RETURN andreas\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (andreas:Person {name:\"Andreas\"}), (emil:Person {name:\"Emil Eifrem\"})\n",
    "MERGE (andreas)-[hasRelationship:WORKS_WITH]->(emil)\n",
    "RETURN andreas, hasRelationship, emil\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete everything in a database\n",
    "cypher = \"\"\"\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 0}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "playaround",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
