{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Extra resource: Knowledge Graphs for RAG (`www.deeplearning.ai`)**\n",
    "\n",
    "**Start the Movie Neo4j DB**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = \"bolt://localhost:7687\"\n",
    "NEO4J_USERNAME = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"12345678\"\n",
    "NEO4J_DATABASE = 'neo4j'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 155}]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfNodes': 155}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n) AS numberOfNodes\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfMovies': 20}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Movie nodes by specifying the node label\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie) \n",
    "  RETURN count(m) AS numberOfMovies\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'numberOfPeople': 101}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match only the Person nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (people:Person) \n",
    "  RETURN count(people) AS numberOfPeople\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom': {'name': 'Tom Hanks'}}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single person by specifying the value of the `name` property on the `Person` node\n",
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"}) \n",
    "  RETURN tom\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match a single Movie by specifying the value of the title property\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (cloudAtlas:Movie {title:\"Cloud Atlas\"}) \n",
    "  RETURN cloudAtlas\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino': {'taglineEmbedding': [0.0026236276607960463,\n",
       "    -0.033300600945949554,\n",
       "    0.01998777873814106,\n",
       "    -0.012422830797731876,\n",
       "    -0.006693495437502861,\n",
       "    0.019579865038394928,\n",
       "    -0.020618190988898277,\n",
       "    0.0028059526812285185,\n",
       "    -0.008102651685476303,\n",
       "    -0.006347386632114649,\n",
       "    0.02023499831557274,\n",
       "    0.015043367631733418,\n",
       "    0.011038395576179028,\n",
       "    0.006878910586237907,\n",
       "    -0.00997534766793251,\n",
       "    -0.011174366809427738,\n",
       "    0.02360955812036991,\n",
       "    0.011310338042676449,\n",
       "    0.004814619198441505,\n",
       "    -0.026872869580984116,\n",
       "    -0.007231199648231268,\n",
       "    0.004428337328135967,\n",
       "    -0.00925222784280777,\n",
       "    0.011712071485817432,\n",
       "    -0.0029712815303355455,\n",
       "    0.0028971154242753983,\n",
       "    0.022657759487628937,\n",
       "    -0.023634281009435654,\n",
       "    0.04605717957019806,\n",
       "    -0.019579865038394928,\n",
       "    0.04042055457830429,\n",
       "    0.014956840313971043,\n",
       "    0.008238623850047588,\n",
       "    -0.030778953805565834,\n",
       "    -0.0400497205555439,\n",
       "    -0.007021062541753054,\n",
       "    -0.02543899044394493,\n",
       "    -0.020729439333081245,\n",
       "    0.005052569322288036,\n",
       "    -0.0026900682132691145,\n",
       "    0.004511774051934481,\n",
       "    -0.011267074383795261,\n",
       "    -0.006384469568729401,\n",
       "    -0.015055729076266289,\n",
       "    -0.044648025184869766,\n",
       "    0.009140978567302227,\n",
       "    0.009913542307913303,\n",
       "    -0.022348733618855476,\n",
       "    -0.009480906650424004,\n",
       "    -0.002167814876884222,\n",
       "    0.013053243048489094,\n",
       "    0.009505628608167171,\n",
       "    -0.011223810724914074,\n",
       "    -0.03377032279968262,\n",
       "    0.005760238040238619,\n",
       "    -0.014314067550003529,\n",
       "    -0.011273255571722984,\n",
       "    0.01410392951220274,\n",
       "    -0.006047631613910198,\n",
       "    0.013918514363467693,\n",
       "    0.006526621524244547,\n",
       "    -0.004208929371088743,\n",
       "    -0.00040134703158400953,\n",
       "    -0.0011712071718648076,\n",
       "    0.013869070447981358,\n",
       "    0.0012646873947232962,\n",
       "    -0.02178012579679489,\n",
       "    0.01908542402088642,\n",
       "    0.002554096980020404,\n",
       "    0.0006848780903965235,\n",
       "    0.02426469326019287,\n",
       "    0.023597197607159615,\n",
       "    0.022534148767590523,\n",
       "    0.006415372248739004,\n",
       "    -0.005522287916392088,\n",
       "    -0.005092742387205362,\n",
       "    -0.020037222653627396,\n",
       "    0.011143464595079422,\n",
       "    -0.0028955701272934675,\n",
       "    -0.003705217270180583,\n",
       "    0.01247845496982336,\n",
       "    -0.009703405201435089,\n",
       "    -0.036020029336214066,\n",
       "    0.004585940390825272,\n",
       "    0.018862925469875336,\n",
       "    0.0013427163939923048,\n",
       "    -0.013658933341503143,\n",
       "    0.013436434790492058,\n",
       "    -0.021100269630551338,\n",
       "    -0.002470660023391247,\n",
       "    0.00779362628236413,\n",
       "    0.012484635226428509,\n",
       "    0.01733015850186348,\n",
       "    0.022249845787882805,\n",
       "    -0.018974173814058304,\n",
       "    0.012904910370707512,\n",
       "    -0.019629308953881264,\n",
       "    0.0135476840659976,\n",
       "    0.01012986060231924,\n",
       "    -0.03498170152306557,\n",
       "    0.006353566888719797,\n",
       "    -0.006730578374117613,\n",
       "    -0.005927111487835646,\n",
       "    -0.007602030411362648,\n",
       "    0.0019499517511576414,\n",
       "    0.0011650266824290156,\n",
       "    -0.011860404163599014,\n",
       "    0.0029032959137111902,\n",
       "    -0.002873938297852874,\n",
       "    0.014005041681230068,\n",
       "    0.007027242798358202,\n",
       "    0.014363511465489864,\n",
       "    0.02768869698047638,\n",
       "    -0.02025972120463848,\n",
       "    0.0014446948189288378,\n",
       "    -0.014425316825509071,\n",
       "    -0.013016159646213055,\n",
       "    -0.019480975344777107,\n",
       "    0.00663787079975009,\n",
       "    -0.02520413137972355,\n",
       "    0.02865285612642765,\n",
       "    0.0014895035419613123,\n",
       "    0.01280602253973484,\n",
       "    -0.017033493146300316,\n",
       "    0.008930840529501438,\n",
       "    0.0003327819867990911,\n",
       "    -0.03552558645606041,\n",
       "    -0.01584683544933796,\n",
       "    0.004657016135752201,\n",
       "    0.01964166946709156,\n",
       "    0.023461226373910904,\n",
       "    0.03248477354645729,\n",
       "    -0.01206436101347208,\n",
       "    -0.015550170093774796,\n",
       "    -0.010216387920081615,\n",
       "    0.006829466670751572,\n",
       "    -0.00038106724969111383,\n",
       "    -0.018207790330052376,\n",
       "    -0.011984013952314854,\n",
       "    -0.011069297790527344,\n",
       "    0.013584766536951065,\n",
       "    -0.0020411142613738775,\n",
       "    -0.0007729503558948636,\n",
       "    -0.0012353300116956234,\n",
       "    0.013498240150511265,\n",
       "    0.011471031233668327,\n",
       "    -0.014128652401268482,\n",
       "    0.00831896997988224,\n",
       "    0.005781869404017925,\n",
       "    0.004076048266142607,\n",
       "    0.0026962487027049065,\n",
       "    -0.01280602253973484,\n",
       "    0.01615585945546627,\n",
       "    -0.016316553577780724,\n",
       "    -0.0037453908007591963,\n",
       "    0.016650300472974777,\n",
       "    -0.0023053311742842197,\n",
       "    -0.007305365987122059,\n",
       "    -0.023535393178462982,\n",
       "    -0.011841862462460995,\n",
       "    -0.00608471455052495,\n",
       "    0.009208964183926582,\n",
       "    0.02378261275589466,\n",
       "    0.012466094456613064,\n",
       "    0.00453958660364151,\n",
       "    0.018096541985869408,\n",
       "    0.005911660380661488,\n",
       "    0.02156998962163925,\n",
       "    -0.004082228522747755,\n",
       "    0.03297921642661095,\n",
       "    0.00415948498994112,\n",
       "    0.02655148319900036,\n",
       "    -0.029147297143936157,\n",
       "    0.012880188412964344,\n",
       "    -0.0014045215211808681,\n",
       "    0.027837028726935387,\n",
       "    -0.014808508567512035,\n",
       "    0.02847980335354805,\n",
       "    -0.012249776162207127,\n",
       "    -0.02389386296272278,\n",
       "    -0.008683620020747185,\n",
       "    -0.0013573950855061412,\n",
       "    0.032534219324588776,\n",
       "    0.04961715638637543,\n",
       "    -0.005880757700651884,\n",
       "    -0.004212019499391317,\n",
       "    0.02254651114344597,\n",
       "    0.01218797080218792,\n",
       "    0.0080284858122468,\n",
       "    -0.003791744587942958,\n",
       "    0.01085916068404913,\n",
       "    0.02023499831557274,\n",
       "    -0.00736099062487483,\n",
       "    0.007589669432491064,\n",
       "    -0.6823285818099976,\n",
       "    -0.013621849939227104,\n",
       "    0.00011617432755883783,\n",
       "    0.009400559589266777,\n",
       "    0.014857952482998371,\n",
       "    -0.003668134333565831,\n",
       "    0.002172450302168727,\n",
       "    0.015513086691498756,\n",
       "    -0.009450003504753113,\n",
       "    0.002657620469108224,\n",
       "    -0.008294248022139072,\n",
       "    0.005077291280031204,\n",
       "    -0.005265797022730112,\n",
       "    -0.0036557733546942472,\n",
       "    -0.03473448008298874,\n",
       "    -0.025562601163983345,\n",
       "    0.0025989054702222347,\n",
       "    -0.025834543630480766,\n",
       "    0.012534080073237419,\n",
       "    0.005027846898883581,\n",
       "    -0.0036186901852488518,\n",
       "    0.02268248237669468,\n",
       "    -0.007911056280136108,\n",
       "    0.00866507925093174,\n",
       "    0.010148401372134686,\n",
       "    0.013634211383759975,\n",
       "    0.002436667215079069,\n",
       "    -0.005775689147412777,\n",
       "    -0.017663905397057533,\n",
       "    0.011056937277317047,\n",
       "    0.0002528215991333127,\n",
       "    0.02064291201531887,\n",
       "    -0.007410434540361166,\n",
       "    0.02171832136809826,\n",
       "    0.043510809540748596,\n",
       "    -0.022670120000839233,\n",
       "    -0.01071700919419527,\n",
       "    0.016242386773228645,\n",
       "    0.007027242798358202,\n",
       "    0.017243631184101105,\n",
       "    -0.013869070447981358,\n",
       "    -0.0032602204009890556,\n",
       "    0.0193326435983181,\n",
       "    -0.012608245946466923,\n",
       "    0.010791175067424774,\n",
       "    -0.007262102328240871,\n",
       "    -0.004857882857322693,\n",
       "    -0.020655272528529167,\n",
       "    -6.996533193159848e-05,\n",
       "    -0.005333782639354467,\n",
       "    0.004082228522747755,\n",
       "    0.015896279364824295,\n",
       "    -0.013485878705978394,\n",
       "    0.0011171277146786451,\n",
       "    -0.005018576513975859,\n",
       "    0.01908542402088642,\n",
       "    -0.003566155908629298,\n",
       "    -0.005679890979081392,\n",
       "    -0.01660085655748844,\n",
       "    0.020185554400086403,\n",
       "    -0.0035507045686244965,\n",
       "    0.009060631506145,\n",
       "    -0.010846800170838833,\n",
       "    0.0013311279471963644,\n",
       "    -0.026848146691918373,\n",
       "    0.03030923381447792,\n",
       "    -0.02147110179066658,\n",
       "    0.03886306285858154,\n",
       "    0.020803606137633324,\n",
       "    -0.0270953681319952,\n",
       "    -0.011106381192803383,\n",
       "    0.006965437904000282,\n",
       "    0.0074907816015183926,\n",
       "    -0.01611877791583538,\n",
       "    0.0067923832684755325,\n",
       "    0.01642780192196369,\n",
       "    0.013646571896970272,\n",
       "    -0.003297303570434451,\n",
       "    0.006749120075255632,\n",
       "    0.013967958278954029,\n",
       "    -0.003593968227505684,\n",
       "    -0.01805945858359337,\n",
       "    -0.0034858090803027153,\n",
       "    0.010469788685441017,\n",
       "    0.014932118356227875,\n",
       "    -0.0006443184684030712,\n",
       "    -0.030259789898991585,\n",
       "    -0.029246186837553978,\n",
       "    -0.02102610468864441,\n",
       "    0.005726245231926441,\n",
       "    0.001898962538689375,\n",
       "    0.030778953805565834,\n",
       "    0.01042652502655983,\n",
       "    0.002538645640015602,\n",
       "    0.015958083793520927,\n",
       "    -0.0048022582195699215,\n",
       "    -0.022447621449828148,\n",
       "    -0.00046894641127437353,\n",
       "    0.020395692437887192,\n",
       "    -0.025006353855133057,\n",
       "    -0.008115013130009174,\n",
       "    -0.012614426203072071,\n",
       "    0.004836251027882099,\n",
       "    0.003495079930871725,\n",
       "    0.017305435612797737,\n",
       "    0.013263380154967308,\n",
       "    -0.00044036153121851385,\n",
       "    0.008634176105260849,\n",
       "    0.05409184843301773,\n",
       "    -0.017206547781825066,\n",
       "    0.006576065439730883,\n",
       "    -0.014042125083506107,\n",
       "    -0.0009564343490637839,\n",
       "    0.0037670223973691463,\n",
       "    -0.014857952482998371,\n",
       "    -0.01915958896279335,\n",
       "    0.01663793995976448,\n",
       "    -0.0031829639337956905,\n",
       "    -0.010105138644576073,\n",
       "    -0.021879015490412712,\n",
       "    0.006915993522852659,\n",
       "    0.012979076243937016,\n",
       "    0.016860438510775566,\n",
       "    -0.021038465201854706,\n",
       "    0.024178165942430496,\n",
       "    0.020939577370882034,\n",
       "    0.007725640665739775,\n",
       "    0.008967923931777477,\n",
       "    -0.02291734144091606,\n",
       "    0.01306560356169939,\n",
       "    -0.015302949585020542,\n",
       "    0.011532836593687534,\n",
       "    0.04635384678840637,\n",
       "    0.006059992592781782,\n",
       "    0.0324600525200367,\n",
       "    -0.001467099180445075,\n",
       "    -0.004202748648822308,\n",
       "    -0.01754029467701912,\n",
       "    0.029394518584012985,\n",
       "    -0.012243595905601978,\n",
       "    0.006063082721084356,\n",
       "    -0.0172559916973114,\n",
       "    -0.017070576548576355,\n",
       "    0.011761515401303768,\n",
       "    -0.02337469905614853,\n",
       "    -0.03082839772105217,\n",
       "    -0.029666461050510406,\n",
       "    0.011631724424660206,\n",
       "    -0.0064091915264725685,\n",
       "    0.0009324848651885986,\n",
       "    0.0036434121429920197,\n",
       "    0.004836251027882099,\n",
       "    0.00431399792432785,\n",
       "    0.015006285160779953,\n",
       "    0.0051576378755271435,\n",
       "    0.004715731367468834,\n",
       "    -0.009925903752446175,\n",
       "    -0.016613218933343887,\n",
       "    -0.04504357650876045,\n",
       "    -0.019703473895788193,\n",
       "    -0.004561218433082104,\n",
       "    0.016996409744024277,\n",
       "    -0.019147228449583054,\n",
       "    -0.006106346379965544,\n",
       "    0.007948139682412148,\n",
       "    -0.024042194709181786,\n",
       "    -0.0019066882086917758,\n",
       "    0.002751873340457678,\n",
       "    0.008411677554249763,\n",
       "    -0.002671526512131095,\n",
       "    -0.004252192564308643,\n",
       "    -0.018183067440986633,\n",
       "    0.00047898973571136594,\n",
       "    0.007602030411362648,\n",
       "    -0.0027225157245993614,\n",
       "    0.0031706029549241066,\n",
       "    -0.012095263227820396,\n",
       "    0.0125155383720994,\n",
       "    0.006576065439730883,\n",
       "    0.00021052370721008629,\n",
       "    0.010241109877824783,\n",
       "    -0.004381983540952206,\n",
       "    0.007255922071635723,\n",
       "    -0.027738140895962715,\n",
       "    0.04796077683568001,\n",
       "    0.018108902499079704,\n",
       "    -0.007762724068015814,\n",
       "    0.0001674532686593011,\n",
       "    -0.013040881603956223,\n",
       "    0.021879015490412712,\n",
       "    0.002832219935953617,\n",
       "    0.01588391698896885,\n",
       "    0.0012229689164087176,\n",
       "    -0.019456254318356514,\n",
       "    0.028108971193432808,\n",
       "    -0.02543899044394493,\n",
       "    0.0056428080424666405,\n",
       "    -0.007521683815866709,\n",
       "    0.008331331424415112,\n",
       "    0.02106318809092045,\n",
       "    0.004140943288803101,\n",
       "    0.009759029373526573,\n",
       "    -0.009833195246756077,\n",
       "    -0.01885056309401989,\n",
       "    -0.0019545871764421463,\n",
       "    -0.03292977064847946,\n",
       "    -0.004854792729020119,\n",
       "    -0.021149713546037674,\n",
       "    0.01454892661422491,\n",
       "    0.022793730720877647,\n",
       "    0.0028862995095551014,\n",
       "    -0.010265831835567951,\n",
       "    0.013473517261445522,\n",
       "    -0.01688516139984131,\n",
       "    0.0004786034405697137,\n",
       "    0.05686071515083313,\n",
       "    0.010006249882280827,\n",
       "    0.01292963232845068,\n",
       "    -0.013139770366251469,\n",
       "    -0.0024073095992207527,\n",
       "    -0.002963555743917823,\n",
       "    -0.003763932269066572,\n",
       "    0.004471600987017155,\n",
       "    -0.016316553577780724,\n",
       "    0.016625579446554184,\n",
       "    0.008578551933169365,\n",
       "    0.017379602417349815,\n",
       "    0.001423062989488244,\n",
       "    0.00602290965616703,\n",
       "    -0.022089151665568352,\n",
       "    -0.019443893805146217,\n",
       "    0.005441941320896149,\n",
       "    0.01536475494503975,\n",
       "    0.0010746365878731012,\n",
       "    0.00395243801176548,\n",
       "    0.017317796126008034,\n",
       "    0.018813481554389,\n",
       "    -0.008535288274288177,\n",
       "    0.027911195531487465,\n",
       "    -0.0025046528317034245,\n",
       "    -0.0026298081502318382,\n",
       "    -0.005132915917783976,\n",
       "    -0.0061156172305345535,\n",
       "    -0.014833230525255203,\n",
       "    0.017342519015073776,\n",
       "    -0.00954271201044321,\n",
       "    0.022942062467336655,\n",
       "    0.017787516117095947,\n",
       "    -0.03297921642661095,\n",
       "    0.022904980927705765,\n",
       "    -0.013189214281737804,\n",
       "    0.019975416362285614,\n",
       "    0.00103987124748528,\n",
       "    -0.005522287916392088,\n",
       "    0.004551947582513094,\n",
       "    -0.026279540732502937,\n",
       "    0.015698501840233803,\n",
       "    -0.005596454255282879,\n",
       "    -0.0043294490315020084,\n",
       "    0.02391858398914337,\n",
       "    0.004969132132828236,\n",
       "    0.014215178787708282,\n",
       "    0.002292970195412636,\n",
       "    -0.01767626591026783,\n",
       "    0.012262137606739998,\n",
       "    -0.002963555743917823,\n",
       "    1.7165408280561678e-05,\n",
       "    -0.013226296752691269,\n",
       "    0.000667495361994952,\n",
       "    -0.021112632006406784,\n",
       "    -0.024586079642176628,\n",
       "    0.005432670470327139,\n",
       "    0.02890007756650448,\n",
       "    0.005024756770581007,\n",
       "    0.021841932088136673,\n",
       "    -0.027021201327443123,\n",
       "    -0.01501864567399025,\n",
       "    -0.027317866683006287,\n",
       "    -0.00014389006537385285,\n",
       "    0.008263345807790756,\n",
       "    0.00609398540109396,\n",
       "    -0.030507011339068413,\n",
       "    -0.0008869035518728197,\n",
       "    0.02892479859292507,\n",
       "    0.0002991754445247352,\n",
       "    -0.04756522551178932,\n",
       "    -0.010241109877824783,\n",
       "    0.007558767218142748,\n",
       "    -0.009548892267048359,\n",
       "    0.008294248022139072,\n",
       "    -0.01802237518131733,\n",
       "    -0.018825842067599297,\n",
       "    -0.011471031233668327,\n",
       "    0.007354809902608395,\n",
       "    0.0025989054702222347,\n",
       "    0.01008041575551033,\n",
       "    0.00608471455052495,\n",
       "    -0.021001381799578667,\n",
       "    -0.008090291172266006,\n",
       "    5.9922000218648463e-05,\n",
       "    0.014079207554459572,\n",
       "    -0.0016548322746530175,\n",
       "    0.018183067440986633,\n",
       "    -0.0023563203867524862,\n",
       "    0.0030856209341436625,\n",
       "    0.008139735087752342,\n",
       "    -0.007830709218978882,\n",
       "    -0.01854153722524643,\n",
       "    -0.03891250863671303,\n",
       "    0.010475968942046165,\n",
       "    -0.013609488494694233,\n",
       "    -0.025154687464237213,\n",
       "    -0.004808438941836357,\n",
       "    -0.023053312674164772,\n",
       "    -0.000944073311984539,\n",
       "    -0.015290588140487671,\n",
       "    0.009208964183926582,\n",
       "    -0.01415337435901165,\n",
       "    0.03859112039208412,\n",
       "    -0.0049042366445064545,\n",
       "    -0.019765280187129974,\n",
       "    0.015068089589476585,\n",
       "    -0.03920917212963104,\n",
       "    0.0003857026167679578,\n",
       "    0.12192915380001068,\n",
       "    0.017898764461278915,\n",
       "    -0.018145985901355743,\n",
       "    0.014400594867765903,\n",
       "    -0.020111387595534325,\n",
       "    -0.004675557836890221,\n",
       "    0.0005937155219726264,\n",
       "    -0.015859195962548256,\n",
       "    0.002078197430819273,\n",
       "    -0.004697189666330814,\n",
       "    -0.004839341621845961,\n",
       "    -0.014857952482998371,\n",
       "    -8.855515625327826e-05,\n",
       "    -0.00875160563737154,\n",
       "    0.027911195531487465,\n",
       "    0.011681169271469116,\n",
       "    0.0011186727788299322,\n",
       "    -0.0027735051698982716,\n",
       "    -0.0017475399654358625,\n",
       "    0.00835605338215828,\n",
       "    -0.023906223475933075,\n",
       "    -0.007187936455011368,\n",
       "    0.019728196784853935,\n",
       "    0.003420913824811578,\n",
       "    -0.01729307509958744,\n",
       "    0.020111387595534325,\n",
       "    0.0023856780026108027,\n",
       "    0.011471031233668327,\n",
       "    -0.0026313532143831253,\n",
       "    -0.005769508425146341,\n",
       "    0.007323907688260078,\n",
       "    0.004913507495075464,\n",
       "    0.007268283050507307,\n",
       "    0.027466198429465294,\n",
       "    -0.014338789507746696,\n",
       "    0.004653926007449627,\n",
       "    -0.011823320761322975,\n",
       "    -0.0002879732637666166,\n",
       "    0.04897438362240791,\n",
       "    -0.028801189735531807,\n",
       "    0.007391893304884434,\n",
       "    -0.007509322836995125,\n",
       "    0.018145985901355743,\n",
       "    0.0069839791394770145,\n",
       "    0.00953035056591034,\n",
       "    0.01611877791583538,\n",
       "    -0.009289310313761234,\n",
       "    0.014635453931987286,\n",
       "    -0.03221283107995987,\n",
       "    -0.02561204507946968,\n",
       "    0.01608169451355934,\n",
       "    -0.00790487602353096,\n",
       "    -0.012731855735182762,\n",
       "    -0.00609398540109396,\n",
       "    0.021223880350589752,\n",
       "    0.01943153142929077,\n",
       "    0.00527197727933526,\n",
       "    -0.015970444306731224,\n",
       "    -0.02934507466852665,\n",
       "    -0.0019484065705910325,\n",
       "    -0.027812307700514793,\n",
       "    -0.022707203403115273,\n",
       "    -0.01712002046406269,\n",
       "    -0.015092811547219753,\n",
       "    -0.003042357275262475,\n",
       "    -0.014301706105470657,\n",
       "    -0.01646488532423973,\n",
       "    -0.00705196475610137,\n",
       "    -0.020272081717848778,\n",
       "    -0.02768869698047638,\n",
       "    0.03258366137742996,\n",
       "    -0.02986423671245575,\n",
       "    0.0021956271957606077,\n",
       "    -0.006563704460859299,\n",
       "    0.011539016850292683,\n",
       "    0.025068160146474838,\n",
       "    0.013584766536951065,\n",
       "    -0.004057506565004587,\n",
       "    -0.011403045617043972,\n",
       "    -0.005253435578197241,\n",
       "    0.00550683680921793,\n",
       "    -0.03149589151144028,\n",
       "    -0.02154526673257351,\n",
       "    -0.020148470997810364,\n",
       "    -0.018145985901355743,\n",
       "    -0.0022280749399214983,\n",
       "    0.011229991912841797,\n",
       "    0.007014881819486618,\n",
       "    -0.018084179610013962,\n",
       "    0.005324511788785458,\n",
       "    0.01788640394806862,\n",
       "    0.0031767834443598986,\n",
       "    0.005812772084027529,\n",
       "    0.004490142688155174,\n",
       "    -0.009344935417175293,\n",
       "    -0.021792488172650337,\n",
       "    0.015117534436285496,\n",
       "    0.009895000606775284,\n",
       "    0.015760308131575584,\n",
       "    0.018838202580809593,\n",
       "    0.000424910249421373,\n",
       "    -0.01757737807929516,\n",
       "    -0.018108902499079704,\n",
       "    -0.002557187108322978,\n",
       "    0.01857862062752247,\n",
       "    0.007843070663511753,\n",
       "    0.030581176280975342,\n",
       "    0.00048323883675038815,\n",
       "    -0.0021956271957606077,\n",
       "    -0.0011132648214697838,\n",
       "    0.0036588634829968214,\n",
       "    -0.016786271706223488,\n",
       "    -0.003340566996484995,\n",
       "    -0.017725709825754166,\n",
       "    -0.005139096174389124,\n",
       "    0.004335629753768444,\n",
       "    0.024326497688889503,\n",
       "    0.0397036150097847,\n",
       "    0.0010128314606845379,\n",
       "    -0.003890632651746273,\n",
       "    -0.025043437257409096,\n",
       "    -0.021013742312788963,\n",
       "    0.015537808649241924,\n",
       "    0.022212762385606766,\n",
       "    0.0018804209539666772,\n",
       "    -0.016872799023985863,\n",
       "    0.006915993522852659,\n",
       "    -0.0072373803704977036,\n",
       "    -0.014511844143271446,\n",
       "    -0.003872091183438897,\n",
       "    0.013943236321210861,\n",
       "    0.02077888324856758,\n",
       "    -0.008115013130009174,\n",
       "    -0.03772585093975067,\n",
       "    -0.03463559225201607,\n",
       "    0.0024258513003587723,\n",
       "    -0.013893792405724525,\n",
       "    -0.002651439979672432,\n",
       "    -0.018566260114312172,\n",
       "    -0.01336226798593998,\n",
       "    -0.0014284709468483925,\n",
       "    -0.01410392951220274,\n",
       "    0.006569885183125734,\n",
       "    -0.016032250598073006,\n",
       "    -0.010908604599535465,\n",
       "    -0.02630426175892353,\n",
       "    -0.003593968227505684,\n",
       "    -0.0013442614581435919,\n",
       "    0.007323907688260078,\n",
       "    0.012021097354590893,\n",
       "    0.003705217270180583,\n",
       "    -0.005763328168541193,\n",
       "    -0.02568621002137661,\n",
       "    0.011044575832784176,\n",
       "    0.0300372913479805,\n",
       "    -0.009882640093564987,\n",
       "    3.3389253076165915e-05,\n",
       "    -0.019394448027014732,\n",
       "    0.006211415398865938,\n",
       "    0.02016083151102066,\n",
       "    0.02409163862466812,\n",
       "    -0.0040235137566924095,\n",
       "    -0.010624301619827747,\n",
       "    0.0011835681507363915,\n",
       "    0.01306560356169939,\n",
       "    0.0010112863965332508,\n",
       "    -0.03013617917895317,\n",
       "    -0.005899299401789904,\n",
       "    -0.01736724004149437,\n",
       "    0.014796147122979164,\n",
       "    -0.0073115467093884945,\n",
       "    0.006251588463783264,\n",
       "    0.000293381221126765,\n",
       "    -0.01336226798593998,\n",
       "    0.0027874112129211426,\n",
       "    0.014857952482998371,\n",
       "    -0.0055284686386585236,\n",
       "    -0.00227442872710526,\n",
       "    -0.03614363819360733,\n",
       "    -0.028504524379968643,\n",
       "    -0.008702161721885204,\n",
       "    -0.03500642254948616,\n",
       "    -0.0267492588609457,\n",
       "    0.00415948498994112,\n",
       "    0.0007895604940131307,\n",
       "    -0.017169464379549026,\n",
       "    0.02178012579679489,\n",
       "    0.017095297574996948,\n",
       "    0.011180547066032887,\n",
       "    0.03038340061903,\n",
       "    0.01902361772954464,\n",
       "    0.007713279686868191,\n",
       "    0.016798634082078934,\n",
       "    0.0037670223973691463,\n",
       "    -0.024252330884337425,\n",
       "    -0.029839515686035156,\n",
       "    0.0009873368544504046,\n",
       "    -0.001436969148926437,\n",
       "    0.008831952698528767,\n",
       "    -0.007688557729125023,\n",
       "    -0.012249776162207127,\n",
       "    0.018034735694527626,\n",
       "    -0.019073061645030975,\n",
       "    -0.0035228922497481108,\n",
       "    0.006260859314352274,\n",
       "    0.013349907472729683,\n",
       "    -0.028628135100007057,\n",
       "    -0.046279679983854294,\n",
       "    0.01754029467701912,\n",
       "    -0.023498309776186943,\n",
       "    0.01888764649629593,\n",
       "    -0.027911195531487465,\n",
       "    -0.0156243359670043,\n",
       "    -0.019480975344777107,\n",
       "    -0.007626752834767103,\n",
       "    0.00880105048418045,\n",
       "    -0.031125061213970184,\n",
       "    -0.00023350749688688666,\n",
       "    -0.021841932088136673,\n",
       "    -0.029691182076931,\n",
       "    0.01192838978022337,\n",
       "    0.0037299394607543945,\n",
       "    0.045241352170705795,\n",
       "    0.009239866398274899,\n",
       "    0.033646710216999054,\n",
       "    0.010618120431900024,\n",
       "    -0.007157033775001764,\n",
       "    -0.015068089589476585,\n",
       "    0.011038395576179028,\n",
       "    0.014993923716247082,\n",
       "    -0.0008822681847959757,\n",
       "    0.04059360548853874,\n",
       "    -0.0020472947508096695,\n",
       "    0.011415407061576843,\n",
       "    0.012441372498869896,\n",
       "    0.008288067765533924,\n",
       "    0.01401740312576294,\n",
       "    5.5962609621929005e-05,\n",
       "    -0.019419170916080475,\n",
       "    0.014091568998992443,\n",
       "    0.003692856291308999,\n",
       "    -0.007509322836995125,\n",
       "    -0.009981527924537659,\n",
       "    -0.012021097354590893,\n",
       "    0.02108790911734104,\n",
       "    0.020457496866583824,\n",
       "    -0.00020163922454230487,\n",
       "    -0.0052472553215920925,\n",
       "    0.00044847343815490603,\n",
       "    -0.008084110915660858,\n",
       "    -0.007157033775001764,\n",
       "    -0.008411677554249763,\n",
       "    -0.026798702776432037,\n",
       "    0.02071707881987095,\n",
       "    0.020964298397302628,\n",
       "    -0.008726883679628372,\n",
       "    -0.006495718844234943,\n",
       "    -0.025834543630480766,\n",
       "    0.006446274928748608,\n",
       "    0.0135476840659976,\n",
       "    -0.023176923394203186,\n",
       "    0.018319040536880493,\n",
       "    -0.007187936455011368,\n",
       "    -9.294911433244124e-05,\n",
       "    -0.017280712723731995,\n",
       "    0.018034735694527626,\n",
       "    -0.02085305005311966,\n",
       "    -0.002078197430819273,\n",
       "    -0.019555142149329185,\n",
       "    0.022769007831811905,\n",
       "    -0.0034518162719905376,\n",
       "    -0.021594710648059845,\n",
       "    -0.0013597127981483936,\n",
       "    -0.003099527209997177,\n",
       "    -0.00022365730546880513,\n",
       "    -0.0010985861299559474,\n",
       "    -0.0024196708109229803,\n",
       "    -0.022806091234087944,\n",
       "    0.01646488532423973,\n",
       "    -0.014128652401268482,\n",
       "    0.01247845496982336,\n",
       "    0.023226367309689522,\n",
       "    -0.004261463414877653,\n",
       "    -0.003380740527063608,\n",
       "    -0.02561204507946968,\n",
       "    -0.03149589151144028,\n",
       "    -0.011804779060184956,\n",
       "    0.003482718952000141,\n",
       "    0.016007527709007263,\n",
       "    -0.01698404923081398,\n",
       "    0.000903127423953265,\n",
       "    -0.001325719989836216,\n",
       "    0.01116818655282259,\n",
       "    0.009283130057156086,\n",
       "    0.005667530000209808,\n",
       "    -0.02339942194521427,\n",
       "    -0.004140943288803101,\n",
       "    0.005210172384977341,\n",
       "    -0.010160762816667557,\n",
       "    0.012231234461069107,\n",
       "    -0.008584732189774513,\n",
       "    -0.008831952698528767,\n",
       "    -0.006035270635038614,\n",
       "    0.005763328168541193,\n",
       "    0.0013396261492744088,\n",
       "    0.004255283158272505,\n",
       "    0.012657689861953259,\n",
       "    -0.016390720382332802,\n",
       "    -0.011681169271469116,\n",
       "    -0.002557187108322978,\n",
       "    -0.0052750674076378345,\n",
       "    0.00907917320728302,\n",
       "    -0.006810924969613552,\n",
       "    0.00497222226113081,\n",
       "    -0.002909476403146982,\n",
       "    -0.0023192374501377344,\n",
       "    -6.397796096280217e-05,\n",
       "    -0.02378261275589466,\n",
       "    0.0012492361711338162,\n",
       "    0.01327574159950018,\n",
       "    -0.012194151990115643,\n",
       "    0.012311581522226334,\n",
       "    0.026699814945459366,\n",
       "    -0.008560010232031345,\n",
       "    -0.0003936213906854391,\n",
       "    0.013856709003448486,\n",
       "    -0.005658259149640799,\n",
       "    -0.011279435828328133,\n",
       "    -0.018553899601101875,\n",
       "    -0.013498240150511265,\n",
       "    -0.016872799023985863,\n",
       "    0.006848007906228304,\n",
       "    -0.0067923832684755325,\n",
       "    -0.03231171891093254,\n",
       "    -0.017490850761532784,\n",
       "    -0.009289310313761234,\n",
       "    -0.007756543345749378,\n",
       "    0.03048228845000267,\n",
       "    -0.007960500195622444,\n",
       "    -0.01118672825396061,\n",
       "    -0.0024134900886565447,\n",
       "    0.03552558645606041,\n",
       "    0.0061156172305345535,\n",
       "    -0.0061279782094061375,\n",
       "    0.01733015850186348,\n",
       "    0.002663800958544016,\n",
       "    0.015278227627277374,\n",
       "    -0.016205303370952606,\n",
       "    -0.0038288275245577097,\n",
       "    -0.021149713546037674,\n",
       "    -0.0139803197234869,\n",
       "    0.0071755750104784966,\n",
       "    0.010179304517805576,\n",
       "    -0.010333817452192307,\n",
       "    -0.011403045617043972,\n",
       "    0.006940715946257114,\n",
       "    -0.042793869972229004,\n",
       "    -0.005404858384281397,\n",
       "    0.005608815234154463,\n",
       "    0.0020102118141949177,\n",
       "    0.023411782458424568,\n",
       "    0.02067999541759491,\n",
       "    0.0031675128266215324,\n",
       "    -0.001192066352814436,\n",
       "    0.008176818490028381,\n",
       "    0.010204026475548744,\n",
       "    -0.005565551575273275,\n",
       "    0.010024791583418846,\n",
       "    -0.011916028335690498,\n",
       "    0.014338789507746696,\n",
       "    0.026947034522891045,\n",
       "    0.011483392678201199,\n",
       "    6.349511295411503e-06,\n",
       "    0.0036650439724326134,\n",
       "    -0.0008250984246842563,\n",
       "    0.019765280187129974,\n",
       "    0.007243561092764139,\n",
       "    0.014660175889730453,\n",
       "    -0.0006956939469091594,\n",
       "    0.01129179634153843,\n",
       "    0.01401740312576294,\n",
       "    0.004932049196213484,\n",
       "    0.018628064543008804,\n",
       "    0.02485802210867405,\n",
       "    0.01988888904452324,\n",
       "    -0.03181727975606918,\n",
       "    0.020210277289152145,\n",
       "    0.009351115673780441,\n",
       "    -0.017095297574996948,\n",
       "    -0.021100269630551338,\n",
       "    -0.01636599749326706,\n",
       "    0.010339997708797455,\n",
       "    0.004400525242090225,\n",
       "    0.01833140105009079,\n",
       "    -0.0033652891870588064,\n",
       "    -0.010914785787463188,\n",
       "    -0.011996375396847725,\n",
       "    -0.02116207592189312,\n",
       "    0.025735653936862946,\n",
       "    0.013930875808000565,\n",
       "    0.009814654476940632,\n",
       "    0.030581176280975342,\n",
       "    0.010556316003203392,\n",
       "    -0.01950569823384285,\n",
       "    -0.005417219363152981,\n",
       "    -0.0030979819130152464,\n",
       "    0.0014516479568555951,\n",
       "    0.0005496793310157955,\n",
       "    0.006780022289603949,\n",
       "    -0.017144741490483284,\n",
       "    -0.01532767154276371,\n",
       "    -0.002458298811689019,\n",
       "    -0.005148367024958134,\n",
       "    -0.013819626532495022,\n",
       "    0.008399317041039467,\n",
       "    0.01160082221031189,\n",
       "    -0.013869070447981358,\n",
       "    -0.023362338542938232,\n",
       "    0.008498204872012138,\n",
       "    0.02803480625152588,\n",
       "    -0.0050958325155079365,\n",
       "    0.00921514444053173,\n",
       "    -0.004338719882071018,\n",
       "    -0.0014354240847751498,\n",
       "    -0.008739245124161243,\n",
       "    -0.018269594758749008,\n",
       "    -0.01746612973511219,\n",
       "    -0.006594607140868902,\n",
       "    0.001412247191183269,\n",
       "    -0.004103860352188349,\n",
       "    -0.0010166943538933992,\n",
       "    -0.00216163438744843,\n",
       "    -0.015661418437957764,\n",
       "    0.0026869778521358967,\n",
       "    0.0019190491875633597,\n",
       "    0.04580996185541153,\n",
       "    0.23555169999599457,\n",
       "    -0.0019144137622788548,\n",
       "    -0.021248603239655495,\n",
       "    0.03493225947022438,\n",
       "    -0.00923368614166975,\n",
       "    0.006501899566501379,\n",
       "    0.002952739829197526,\n",
       "    0.0026205372996628284,\n",
       "    -0.007132311817258596,\n",
       "    -0.0013604853302240372,\n",
       "    -0.016353636980056763,\n",
       "    -0.008529107086360455,\n",
       "    -0.012917271815240383,\n",
       "    0.0009123981581069529,\n",
       "    0.0066131483763456345,\n",
       "    -0.02585926465690136,\n",
       "    -0.010160762816667557,\n",
       "    -0.0022218942176550627,\n",
       "    -0.014301706105470657,\n",
       "    -0.001083907438442111,\n",
       "    0.015315310098230839,\n",
       "    -0.015562530606985092,\n",
       "    -0.006891271565109491,\n",
       "    -0.005080381408333778,\n",
       "    0.03676168993115425,\n",
       "    -0.012917271815240383,\n",
       "    -0.01546364277601242,\n",
       "    0.014536566101014614,\n",
       "    0.008776327595114708,\n",
       "    -0.007064326200634241,\n",
       "    0.0013597127981483936,\n",
       "    0.008467302657663822,\n",
       "    0.006736758630722761,\n",
       "    0.017750432714819908,\n",
       "    -0.01829431764781475,\n",
       "    -0.006276310421526432,\n",
       "    0.022694842889904976,\n",
       "    -0.014771425165235996,\n",
       "    0.004341810010373592,\n",
       "    0.029493406414985657,\n",
       "    0.019134867936372757,\n",
       "    0.00968486350029707,\n",
       "    5.683174458681606e-05,\n",
       "    -0.012113804928958416,\n",
       "    0.019740557298064232,\n",
       "    0.022830814123153687,\n",
       "    ...],\n",
       "   'tagline': 'No one stays at the top forever.',\n",
       "   'imdbRating': 8.2,\n",
       "   'id': '16',\n",
       "   'title': 'Casino',\n",
       "   'released': neo4j.time.Date(1995, 11, 22)}}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released.year': 1995}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return only the released property of the matched Movie node\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released.year\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Casino.released': neo4j.time.Date(1995, 11, 22),\n",
       "  'Casino.tagline': 'No one stays at the top forever.'}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (Casino:Movie {title:\"Casino\"}) \n",
    "  RETURN Casino.released, Casino.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'m.released': neo4j.time.Date(1995, 12, 22),\n",
       "  'm.tagline': 'Terror goes into overtime.'}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Return two properties\n",
    "cypher = \"\"\"\n",
    "  MATCH (m:Movie {title:\"Sudden Death\"}) \n",
    "  RETURN m.released, m.tagline\n",
    "  \"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nineties.title': 'Toy Story'},\n",
       " {'nineties.title': 'Jumanji'},\n",
       " {'nineties.title': 'Grumpier Old Men'},\n",
       " {'nineties.title': 'Waiting to Exhale'},\n",
       " {'nineties.title': 'Father of the Bride Part II'},\n",
       " {'nineties.title': 'Heat'},\n",
       " {'nineties.title': 'Sabrina'},\n",
       " {'nineties.title': 'Tom and Huck'},\n",
       " {'nineties.title': 'Sudden Death'},\n",
       " {'nineties.title': 'GoldenEye'},\n",
       " {'nineties.title': 'American President, The'},\n",
       " {'nineties.title': 'Dracula: Dead and Loving It'},\n",
       " {'nineties.title': 'Balto'},\n",
       " {'nineties.title': 'Nixon'},\n",
       " {'nineties.title': 'Cutthroat Island'},\n",
       " {'nineties.title': 'Casino'},\n",
       " {'nineties.title': 'Sense and Sensibility'},\n",
       " {'nineties.title': 'Four Rooms'},\n",
       " {'nineties.title': 'Ace Ventura: When Nature Calls'},\n",
       " {'nineties.title': 'Money Train'}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Cypher patterns with conditional matching\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (nineties:Movie) \n",
    "  WHERE nineties.released.year >= 1900\n",
    "    AND nineties.released.year < 2000\n",
    "  RETURN nineties.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'actor.name': 'Don Rickles', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tom Hanks', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Tim Allen', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Jim Varney', 'movie.title': 'Toy Story'},\n",
       " {'actor.name': 'Kirsten Dunst', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Robin Williams', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Bradley Pierce', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Jonathan Hyde', 'movie.title': 'Jumanji'},\n",
       " {'actor.name': 'Sophia Loren', 'movie.title': 'Grumpier Old Men'},\n",
       " {'actor.name': 'Walter Matthau', 'movie.title': 'Grumpier Old Men'}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Pattern matching with multiple nodes\n",
    "\n",
    "cypher = \"\"\"\n",
    "  MATCH (actor:Person)-[:ACTED_IN]->(movie:Movie) \n",
    "  RETURN actor.name, movie.title LIMIT 10\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'tom.name': 'Tom Hanks', 'tomHanksMovies.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name: \"Tom Hanks\"})-[:ACTED_IN]->(tomHanksMovies:Movie) \n",
    "  RETURN tom.name,tomHanksMovies.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'coActors.name': 'Don Rickles', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Tim Allen', 'm.title': 'Toy Story'},\n",
       " {'coActors.name': 'Jim Varney', 'm.title': 'Toy Story'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (tom:Person {name:\"Tom Hanks\"})-[:ACTED_IN]->(m)<-[:ACTED_IN]-(coActors) \n",
    "  RETURN coActors.name, m.title\n",
    "  \"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Delete/Add (Proceed with caution)** "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete data from the graph\n",
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "RETURN emil.name, movie.title\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (emil:Person {name:\"Emil Eifrem\"})-[actedIn:ACTED_IN]->(movie:Movie)\n",
    "DELETE actedIn\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'andreas': {'name': 'Andreas'}}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Adding data to the graph\n",
    "cypher = \"\"\"\n",
    "CREATE (andreas:Person {name:\"Andreas\"})\n",
    "RETURN andreas\n",
    "\"\"\"\n",
    "\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "MATCH (andreas:Person {name:\"Andreas\"}), (emil:Person {name:\"Emil Eifrem\"})\n",
    "MERGE (andreas)-[hasRelationship:WORKS_WITH]->(emil)\n",
    "RETURN andreas, hasRelationship, emil\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete everything in a database\n",
    "cypher = \"\"\"\n",
    "MATCH (n)\n",
    "DETACH DELETE n\n",
    "\"\"\"\n",
    "graph.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 0}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n) \n",
    "  RETURN count(n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "result"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "playaround",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
